app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create((params[:comment]).permit(:name, :comment))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)